FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_LPC54018_MCUXpresso/NXP_Code/drivers/fsl_usart.c
    /* check arguments */
    assert( !( ( NULL == base ) || ( NULL == config ) || ( 0U == srcClock_Hz ) ) );

    if( ( NULL == base ) || ( NULL == config ) || ( 0U == srcClock_Hz ) )
    {
        return kStatus_InvalidArgument;
    }

    /* initialize flexcomm to USART mode */
    result = FLEXCOMM_Init( base, FLEXCOMM_PERIPH_USART );

    if( kStatus_Success != result )
    {
        return result;
    }

    if( config->enableTx )
    {
        /* empty and enable txFIFO */
        base->FIFOCFG |= USART_FIFOCFG_EMPTYTX_MASK | USART_FIFOCFG_ENABLETX_MASK;
        /* setup trigger level */
        base->FIFOTRIG &= ~( USART_FIFOTRIG_TXLVL_MASK );
        base->FIFOTRIG |= USART_FIFOTRIG_TXLVL( config->txWatermark );
        /* enable trigger interrupt */
        base->FIFOTRIG |= USART_FIFOTRIG_TXLVLENA_MASK;
    }

    /* empty and enable rxFIFO */
    if( config->enableRx )
    {
        base->FIFOCFG |= USART_FIFOCFG_EMPTYRX_MASK | USART_FIFOCFG_ENABLERX_MASK;
        /* setup trigger level */
        base->FIFOTRIG &= ~( USART_FIFOTRIG_RXLVL_MASK );
        base->FIFOTRIG |= USART_FIFOTRIG_RXLVL( config->rxWatermark );
        /* enable trigger interrupt */
        base->FIFOTRIG |= USART_FIFOTRIG_RXLVLENA_MASK;
    }

    /* setup configuration and enable USART */
    base->CFG = USART_CFG_PARITYSEL( config->parityMode ) | USART_CFG_STOPLEN( config->stopBitCount ) |
                USART_CFG_DATALEN( config->bitCountPerChar ) | USART_CFG_LOOP( config->loopback ) |
                USART_CFG_SYNCEN( ( uint32_t ) config->syncMode >> 1 ) | USART_CFG_SYNCMST( ( uint8_t ) config->syncMode ) |
                USART_CFG_CLKPOL( config->clockPolarity ) | USART_CFG_ENABLE_MASK;

    /* Setup baudrate */
    result = USART_SetBaudRate( base, config->baudRate_Bps, srcClock_Hz );

    if( kStatus_Success != result )
    {
        return result;
    }

    /* Setting continuous Clock configuration. used for synchronous mode. */
    USART_EnableContinuousSCLK( base, config->enableContinuousSCLK );

    return kStatus_Success;
}

/*!
 * brief Deinitializes a USART instance.
 *
 * This function waits for TX complete, disables TX and RX, and disables the USART clock.
 *
 * param base USART peripheral base address.
 */
void USART_Deinit( USART_Type * base )
{
    /* Check arguments */
    assert( NULL != base );

    while( 0U == ( base->STAT & USART_STAT_TXIDLE_MASK ) )
    {
    }

    /* Disable interrupts, disable dma requests, disable peripheral */
    base->FIFOINTENCLR = USART_FIFOINTENCLR_TXERR_MASK | USART_FIFOINTENCLR_RXERR_MASK | USART_FIFOINTENCLR_TXLVL_MASK |
                         USART_FIFOINTENCLR_RXLVL_MASK;
    base->FIFOCFG &= ~( USART_FIFOCFG_DMATX_MASK | USART_FIFOCFG_DMARX_MASK );
    base->CFG &= ~( USART_CFG_ENABLE_MASK );
}

/*!
 * brief Gets the default configuration structure.
 *
 * This function initializes the USART configuration structure to a default value. The default
 * values are:
 *   usartConfig->baudRate_Bps = 115200U;
 *   usartConfig->parityMode = kUSART_ParityDisabled;
 *   usartConfig->stopBitCount = kUSART_OneStopBit;
 *   usartConfig->bitCountPerChar = kUSART_8BitsPerChar;
 *   usartConfig->loopback = false;
 *   usartConfig->enableTx = false;
 *   usartConfig->enableRx = false;
 *
 * param config Pointer to configuration structure.
 */
void USART_GetDefaultConfig( usart_config_t * config )
{
    /* Check arguments */
    assert( NULL != config );

    /* Initializes the configure structure to zero. */
    ( void ) memset( config, 0, sizeof( *config ) );

    /* Set always all members ! */
    config->baudRate_Bps = 115200U;
    config->parityMode = kUSART_ParityDisabled;
    config->stopBitCount = kUSART_OneStopBit;
    config->bitCountPerChar = kUSART_8BitsPerChar;
    config->loopback = false;
    config->enableRx = false;
    config->enableTx = false;
    config->txWatermark = kUSART_TxFifo0;
    config->rxWatermark = kUSART_RxFifo1;
    config->syncMode = kUSART_SyncModeDisabled;
    config->enableContinuousSCLK = false;
    config->clockPolarity = kUSART_RxSampleOnFallingEdge;
}

/*!
 * brief Sets the USART instance baud rate.
 *
 * This function configures the USART module baud rate. This function is used to update
 * the USART module baud rate after the USART module is initialized by the USART_Init.
 * code
 *  USART_SetBaudRate(USART1, 115200U, 20000000U);
 * endcode
 *
 * param base USART peripheral base address.
 * param baudrate_Bps USART baudrate to be set.
 * param srcClock_Hz USART clock source frequency in HZ.
 * retval kStatus_USART_BaudrateNotSupport Baudrate is not support in current clock source.
 * retval kStatus_Success Set baudrate succeed.
 * retval kStatus_InvalidArgument One or more arguments are invalid.
 */
status_t USART_SetBaudRate( USART_Type * base,
                            uint32_t baudrate_Bps,
                            uint32_t srcClock_Hz )
{
    uint32_t best_diff = ( uint32_t ) -1, best_osrval = 0xf, best_brgval = ( uint32_t ) -1;
    uint32_t osrval, brgval, diff, baudrate;

    /* check arguments */
    assert( !( ( NULL == base ) || ( 0 == baudrate_Bps ) || ( 0 == srcClock_Hz ) ) );

    if( ( NULL == base ) || ( 0U == baudrate_Bps ) || ( 0U == srcClock_Hz ) )
    {
        return kStatus_InvalidArgument;
    }

    /* If synchronous master mode is enabled, only configure the BRG value. */
    if( ( base->CFG & USART_CFG_SYNCEN_MASK ) != 0U )
    {
        if( ( base->CFG & USART_CFG_SYNCMST_MASK ) != 0U )
        {
            brgval = srcClock_Hz / baudrate_Bps;
            base->BRG = brgval - 1U;
        }
    }
    else
    {
        /*
         * Smaller values of OSR can make the sampling position within a data bit less accurate and may
         * potentially cause more noise errors or incorrect data.
         */
        for( osrval = best_osrval; osrval >= 8U; osrval-- )
        {
            brgval = ( ( ( srcClock_Hz * 10U ) / ( ( osrval + 1U ) * baudrate_Bps ) ) - 5U ) / 10U;

            if( brgval > 0xFFFFU )
            {
                continue;
            }

            baudrate = srcClock_Hz / ( ( osrval + 1U ) * ( brgval + 1U ) );
            diff = baudrate_Bps < baudrate ? baudrate - baudrate_Bps : baudrate_Bps - baudrate;

            if( diff < best_diff )
            {
                best_diff = diff;
                best_osrval = osrval;
                best_brgval = brgval;
            }
        }

        /* value over range */
        if( best_brgval > 0xFFFFU )
        {
            return kStatus_USART_BaudrateNotSupport;
        }

