FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_LPC54018_MCUXpresso/NXP_Code/drivers/fsl_usart.c
        base->OSR = best_osrval;
        base->BRG = best_brgval;
    }

    return kStatus_Success;
}

/*!
 * brief Writes to the TX register using a blocking method.
 *
 * This function polls the TX register, waits for the TX register to be empty or for the TX FIFO
 * to have room and writes data to the TX buffer.
 *
 * param base USART peripheral base address.
 * param data Start address of the data to write.
 * param length Size of the data to write.
 */
void USART_WriteBlocking( USART_Type * base,
                          const uint8_t * data,
                          size_t length )
{
    /* Check arguments */
    assert( !( ( NULL == base ) || ( NULL == data ) ) );

    if( ( NULL == base ) || ( NULL == data ) )
    {
        return;
    }

    /* Check whether txFIFO is enabled */
    if( 0U == ( base->FIFOCFG & USART_FIFOCFG_ENABLETX_MASK ) )
    {
        return;
    }

    for( ; length > 0U; length-- )
    {
        /* Loop until txFIFO get some space for new data */
        while( 0U == ( base->FIFOSTAT & USART_FIFOSTAT_TXNOTFULL_MASK ) )
        {
        }

        base->FIFOWR = *data;
        data++;
    }

    /* Wait to finish transfer */
    while( 0U == ( base->STAT & USART_STAT_TXIDLE_MASK ) )
    {
    }
}

/*!
 * brief Read RX data register using a blocking method.
 *
 * This function polls the RX register, waits for the RX register to be full or for RX FIFO to
 * have data and read data from the TX register.
 *
 * param base USART peripheral base address.
 * param data Start address of the buffer to store the received data.
 * param length Size of the buffer.
 * retval kStatus_USART_FramingError Receiver overrun happened while receiving data.
 * retval kStatus_USART_ParityError Noise error happened while receiving data.
 * retval kStatus_USART_NoiseError Framing error happened while receiving data.
 * retval kStatus_USART_RxError Overflow or underflow rxFIFO happened.
 * retval kStatus_Success Successfully received all data.
 */
status_t USART_ReadBlocking( USART_Type * base,
                             uint8_t * data,
                             size_t length )
{
    uint32_t statusFlag;
    status_t status = kStatus_Success;

    /* check arguments */
    assert( !( ( NULL == base ) || ( NULL == data ) ) );

    if( ( NULL == base ) || ( NULL == data ) )
    {
        return kStatus_InvalidArgument;
    }

    /* Check whether rxFIFO is enabled */
    if( ( base->FIFOCFG & USART_FIFOCFG_ENABLERX_MASK ) == 0U )
    {
        return kStatus_Fail;
    }

    for( ; length > 0U; length-- )
    {
        /* loop until rxFIFO have some data to read */
        while( ( base->FIFOSTAT & USART_FIFOSTAT_RXNOTEMPTY_MASK ) == 0U )
        {
        }

        /* check rxFIFO statusFlag */
        if( ( base->FIFOSTAT & USART_FIFOSTAT_RXERR_MASK ) != 0U )
        {
            base->FIFOCFG |= USART_FIFOCFG_EMPTYRX_MASK;
            base->FIFOSTAT |= USART_FIFOSTAT_RXERR_MASK;
            status = kStatus_USART_RxError;
            break;
        }

        /* check receive statusFlag */
        statusFlag = base->STAT;
        /* Clear all status flags */
        base->STAT |= statusFlag;

        if( ( statusFlag & USART_STAT_PARITYERRINT_MASK ) != 0U )
        {
            status = kStatus_USART_ParityError;
        }

        if( ( statusFlag & USART_STAT_FRAMERRINT_MASK ) != 0U )
        {
            status = kStatus_USART_FramingError;
        }

        if( ( statusFlag & USART_STAT_RXNOISEINT_MASK ) != 0U )
        {
            status = kStatus_USART_NoiseError;
        }

        if( kStatus_Success == status )
        {
            *data = ( uint8_t ) base->FIFORD;
            data++;
        }
        else
        {
            break;
        }
    }

    return status;
}

/*!
 * brief Initializes the USART handle.
 *
 * This function initializes the USART handle which can be used for other USART
 * transactional APIs. Usually, for a specified USART instance,
 * call this API once to get the initialized handle.
 *
 * param base USART peripheral base address.
 * param handle USART handle pointer.
 * param callback The callback function.
 * param userData The parameter of the callback function.
 */
status_t USART_TransferCreateHandle( USART_Type * base,
                                     usart_handle_t * handle,
                                     usart_transfer_callback_t callback,
                                     void * userData )
{
    /* Check 'base' */
    assert( !( ( NULL == base ) || ( NULL == handle ) ) );

    uint32_t instance = 0;
    usart_to_flexcomm_t handler;
    handler.usart_master_handler = USART_TransferHandleIRQ;

    if( ( NULL == base ) || ( NULL == handle ) )
    {
        return kStatus_InvalidArgument;
    }

    instance = USART_GetInstance( base );

    ( void ) memset( handle, 0, sizeof( *handle ) );
    /* Set the TX/RX state. */
    handle->rxState = ( uint8_t ) kUSART_RxIdle;
    handle->txState = ( uint8_t ) kUSART_TxIdle;
    /* Set the callback and user data. */
    handle->callback = callback;
    handle->userData = userData;
    handle->rxWatermark = ( uint8_t ) USART_FIFOTRIG_RXLVL_GET( base );
    handle->txWatermark = ( uint8_t ) USART_FIFOTRIG_TXLVL_GET( base );

    FLEXCOMM_SetIRQHandler( base, handler.flexcomm_handler, handle );

    /* Enable interrupt in NVIC. */
    ( void ) EnableIRQ( s_usartIRQ[ instance ] );

    return kStatus_Success;
}

/*!
 * brief Transmits a buffer of data using the interrupt method.
 *
 * This function sends data using an interrupt method. This is a non-blocking function, which
 * returns directly without waiting for all data to be written to the TX register. When
 * all data is written to the TX register in the IRQ handler, the USART driver calls the callback
 * function and passes the ref kStatus_USART_TxIdle as status parameter.
 *
 * note The kStatus_USART_TxIdle is passed to the upper layer when all data is written
 * to the TX register. However it does not ensure that all data are sent out. Before disabling the TX,
 * check the kUSART_TransmissionCompleteFlag to ensure that the TX is finished.
 *
 * param base USART peripheral base address.
 * param handle USART handle pointer.
 * param xfer USART transfer structure. See  #usart_transfer_t.
 * retval kStatus_Success Successfully start the data transmission.
 * retval kStatus_USART_TxBusy Previous transmission still not finished, data not all written to TX register yet.
 * retval kStatus_InvalidArgument Invalid argument.
 */
status_t USART_TransferSendNonBlocking( USART_Type * base,
                                        usart_handle_t * handle,
                                        usart_transfer_t * xfer )
{
    /* Check arguments */
    assert( !( ( NULL == base ) || ( NULL == handle ) || ( NULL == xfer ) ) );

    if( ( NULL == base ) || ( NULL == handle ) || ( NULL == xfer ) )
    {
        return kStatus_InvalidArgument;
    }

    /* Check xfer members */
    assert( !( ( 0 == xfer->dataSize ) || ( NULL == xfer->data ) ) );

    if( ( 0U == xfer->dataSize ) || ( NULL == xfer->data ) )
    {
        return kStatus_InvalidArgument;
    }

    /* Return error if current TX busy. */
    if( ( uint8_t ) kUSART_TxBusy == handle->txState )
    {
        return kStatus_USART_TxBusy;
    }
    else
    {
        handle->txData = xfer->data;
        handle->txDataSize = xfer->dataSize;
        handle->txDataSizeAll = xfer->dataSize;
        handle->txState = ( uint8_t ) kUSART_TxBusy;
        /* Enable transmiter interrupt. */
        base->FIFOINTENSET |= USART_FIFOINTENSET_TXLVL_MASK;
    }

    return kStatus_Success;
}

/*!
 * brief Aborts the interrupt-driven data transmit.
 *
 * This function aborts the interrupt driven data sending. The user can get the remainBtyes to find out
 * how many bytes are still not sent out.
 *
 * param base USART peripheral base address.
 * param handle USART handle pointer.
 */
void USART_TransferAbortSend( USART_Type * base,
                              usart_handle_t * handle )
{
    assert( NULL != handle );

    /* Disable interrupts */
    USART_DisableInterrupts( base, ( uint32_t ) kUSART_TxLevelInterruptEnable );
    /* Empty txFIFO */
    base->FIFOCFG |= USART_FIFOCFG_EMPTYTX_MASK;

    handle->txDataSize = 0U;
    handle->txState = ( uint8_t ) kUSART_TxIdle;
}

/*!
 * brief Get the number of bytes that have been written to USART TX register.
 *
 * This function gets the number of bytes that have been written to USART TX
 * register by interrupt method.
 *
 * param base USART peripheral base address.
 * param handle USART handle pointer.
 * param count Send bytes count.
 * retval kStatus_NoTransferInProgress No send in progress.
 * retval kStatus_InvalidArgument Parameter is invalid.
 * retval kStatus_Success Get successfully through the parameter \p count;
 */
status_t USART_TransferGetSendCount( USART_Type * base,
                                     usart_handle_t * handle,
                                     uint32_t * count )
{
    assert( NULL != handle );
    assert( NULL != count );

    if( ( uint8_t ) kUSART_TxIdle == handle->txState )
    {
        return kStatus_NoTransferInProgress;
    }

    *count = handle->txDataSizeAll - handle->txDataSize;

    return kStatus_Success;
}

/*!
 * brief Receives a buffer of data using an interrupt method.
 *
 * This function receives data using an interrupt method. This is a non-blocking function, which
 *  returns without waiting for all data to be received.
 * If the RX ring buffer is used and not empty, the data in the ring buffer is copied and
 * the parameter p receivedBytes shows how many bytes are copied from the ring buffer.
 * After copying, if the data in the ring buffer is not enough to read, the receive
 * request is saved by the USART driver. When the new data arrives, the receive request
 * is serviced first. When all data is received, the USART driver notifies the upper layer
 * through a callback function and passes the status parameter ref kStatus_USART_RxIdle.
 * For example, the upper layer needs 10 bytes but there are only 5 bytes in the ring buffer.
 * The 5 bytes are copied to the xfer->data and this function returns with the
 * parameter p receivedBytes set to 5. For the left 5 bytes, newly arrived data is
 * saved from the xfer->data[5]. When 5 bytes are received, the USART driver notifies the upper layer.
 * If the RX ring buffer is not enabled, this function enables the RX and RX interrupt
 * to receive data to the xfer->data. When all data is received, the upper layer is notified.
 *
 * param base USART peripheral base address.
 * param handle USART handle pointer.
 * param xfer USART transfer structure, see #usart_transfer_t.
 * param receivedBytes Bytes received from the ring buffer directly.
 * retval kStatus_Success Successfully queue the transfer into transmit queue.
 * retval kStatus_USART_RxBusy Previous receive request is not finished.
 * retval kStatus_InvalidArgument Invalid argument.
 */
status_t USART_TransferReceiveNonBlocking( USART_Type * base,
                                           usart_handle_t * handle,
                                           usart_transfer_t * xfer,
                                           size_t * receivedBytes )
{
    uint32_t i;
    /* How many bytes to copy from ring buffer to user memory. */
    size_t bytesToCopy = 0U;
    /* How many bytes to receive. */
    size_t bytesToReceive;
    /* How many bytes currently have received. */
    size_t bytesCurrentReceived;
    uint32_t regPrimask = 0U;

